In [2]:
import numpy as np

import pandas as pd

from pandas import Series , DataFrame

dframe1=data({'key':['X','Y','Z','Z','X','X'],'data_set_1':np.arange(6)})

In [5]:
dframe1=DataFrame({'key':['X','Y','Z','Z','X','X'],'data_set_1':np.arange(6)})

In [6]:
dframe1

   data_set_1 key
0           0   X
1           1   Y
2           2   Z
3           3   Z
4           4   X
5           5   X

In [10]:
dframe2=DataFrame({'key':['Q','Y','Z'],'data_set_2':np.arange(3)})

In [11]:
dframe2

   data_set_2 key
0           0   Q
1           1   Y
2           2   Z

In [12]:
pd.merge(dframe1,dframe2)

   data_set_1 key  data_set_2
0           1   Y           1
1           2   Z           2
2           3   Z           2

In [13]:
pd.merge(dframe1,dframe2,on='key')

   data_set_1 key  data_set_2
0           1   Y           1
1           2   Z           2
2           3   Z           2

In [14]:
pd.merge(dframe1,dframe2,on='key',how='left')

   data_set_1 key  data_set_2
0           0   X         NaN
1           1   Y           1
2           2   Z           2
3           3   Z           2
4           4   X         NaN
5           5   X         NaN

In [15]:
pd.merge(dframe1,dframe2,on='key',how='right')

   data_set_1 key  data_set_2
0           1   Y           1
1           2   Z           2
2           3   Z           2
3         NaN   Q           0

In [16]:
pd.merge(dframe1,dframe2,on='key',how='outer')

   data_set_1 key  data_set_2
0           0   X         NaN
1           4   X         NaN
2           5   X         NaN
3           1   Y           1
4           2   Z           2
5           3   Z           2
6         NaN   Q           0

In [18]:
dframe3=DataFrame({'key':['X','Y','X','Z','Z','X'],'data_set_3':np.arange(6)})

In [19]:
dframe4=DataFrame({'key':['Y','Y','X','Z','X'],'data_set_4':np.arange(5)})

In [20]:
dframe3

   data_set_3 key
0           0   X
1           1   Y
2           2   X
3           3   Z
4           4   Z
5           5   X

In [21]:
dframe4

   data_set_4 key
0           0   Y
1           1   Y
2           2   X
3           3   Z
4           4   X

In [22]:
pd.merge(dframe3,dframe4)

   data_set_3 key  data_set_4
0           0   X           2
1           0   X           4
2           2   X           2
3           2   X           4
4           5   X           2
5           5   X           4
6           1   Y           0
7           1   Y           1
8           3   Z           3
9           4   Z           3

#Merge on Index

In [23]:
df_left= DataFrame({'key':['X','Y','Z','X','Y'],
                    'data':np.arange(5)})

In [24]:
df_left

   data key
0     0   X
1     1   Y
2     2   Z
3     3   X
4     4   Y

In [26]:
df_right=DataFrame({'group_data':[10,20]},index=['X','Y'])

In [27]:
df_right

   group_data
X          10
Y          20

In [28]:
pd.merge(df_left,df_right,left_on='key',right_index=True)

   data key  group_data
0     0   X          10
3     3   X          10
1     1   Y          20
4     4   Y          20

In [29]:
df_left_hr=DataFrame({'key1':['SF','SF','SF','LA','LA'],
                    'key2':[10,20,30,40,50],
                     'data_set':np.arange(5.)})

In [30]:
df_left_hr

   data_set key1  key2
0         0   SF    10
1         1   SF    20
2         2   SF    30
3         3   LA    40
4         4   LA    50

In [31]:
df_right_hr=DataFrame(np.arange(10).reshape(5,2),
                    index=[['LA','LA','SF','SF','SF'],
                          [20,10,10,10,20]],
                     columns=['col1','col2'])

In [32]:
df_right_hr

       col1  col2
LA 20     0     1
   10     2     3
SF 10     4     5
   10     6     7
   20     8     9

In [33]:
 pd.merge(df_left_hr,df_right_hr,left_on=['key1','key2'],right_index=True)

   data_set key1  key2  col1  col2
0         0   SF    10     4     5
0         0   SF    10     6     7
1         1   SF    20     8     9

In [34]:
df_left.join(df_right)

   data key  group_data
0     0   X         NaN
1     1   Y         NaN
2     2   Z         NaN
3     3   X         NaN
4     4   Y         NaN